{
    "project":[
        {
            "id":"RandomMovieGenerator", 
            "gitHub": "https://github.com/adame221/Movie-Generator", 
            "video":"videos/RandomMovieVideo.mov", 
            "image1":"./img/movie1.png", 
            "name":"Random Movie Generator", 
            "lastUpdated": "05/17/2020",
            "iframePath" : "",
            "subName":"Searches an api for a random movie", 
            "description1":"This project allows a user to search by movie title.  The user inputted text sent as a parameter to the a movie rest api.  If there was movie that matched the input, then the movie details are displayed in the HTML.  If there is no movie found, then an error message is displayed.  A user can user search on a random movie in the api.", 
            "description2":"The cool features within this app is that once a movie is returned, the user can over Metacritic, Rotten Tomato’s, and Imbd logos to find the corresponding ratings for the selected movie.  If the user clicks on the one of the rating logos, then they’ll be directed to that site with the movie prepopulated."
        },

        {
            "id":"CountrySearch", 
            "gitHub": "https://github.com/adame221/Country-Search", 
            "video":"videos/CountrySearchVideo.mov", 
            "image1":"./img/map.jpg", 
            "name":"Country Search", 
            "lastUpdated": "05/25/2020",
            "iframePath" : "",
            "subName":"Searches an api for countries based on input", 
            "description1":"This app allows the user to search for a specific country, or countries with a similar name.  The api used for this project <a href='https://restcountries.eu' target='_blank'>https://restcountries.eu</a>.", 
            "description2":"If this api returns any data, the front-end will display Country Codes, Flag Image, Region, Subregion, Population, Languages.  Addtionally there will be a count of how many countries were returned.  The second table on the webpage displays how many times a region/subregion appeared in that specific search."
        },

        {
            "id":"ReactToDoApp", 
            "gitHub": "https://github.com/adame221/React-ToDo-App", 
            "video":"", 
            "image1":"./img/ToDoList.jpg", 
            "name":"React To Do App", 
            "lastUpdated": "05/25/2020",
            "iframePath" : "Projects/React-Todo-App/index.html",
            "subName":"Outputs each item in a JSON array.", 
            "description1":"This program reads in a hardcoded JSON array, then outputs each item as a checklist item.  There's an attribute on each item within the array that dertermines weather or not the item has been completed.  When an item is completed there will be a strikethrough the item.  Please feel free to play around with the application in the iframe below.", 
            "description2":"This is my very first React app so there will be more updates to come in the future.  These updates would include adding new items to the checklist, as well as deleting an item from the checklist."
        },

        {
            "id":"ReactRandomMemeGenerator", 
            "gitHub": "https://github.com/adame221/React-Random-Meme-Generator", 
            "video":"", 
            "image1":"http://www.pngall.com/wp-content/uploads/2016/05/Trollface.png", 
            "name":"React Random Meme Generator", 
            "lastUpdated": "05/30/2020",
            "iframePath" : "Projects/React-Meme-Generator/index.html",
            "subName":"Get a random meme from an api, with customizable text.", 
            "description1":"This app grabs a random meme image from <a href='https://imgflip.com/' target='_blank'>imgflip api</a> and displays the image to the screen every time you click the generate button.  Additionally you can customize this meme image by adding top text and bottom text.  Please feel free to play around with the app in the iframe below.", 
            "description2":"This is officially my second React App.  Stayed tuned for more updates."
        }
    ]
}


